stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
#define ISM6HG256X_UI_OUTY_H_A_OIS_HG             0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outy_a_ois_hg             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outy_a_ois_hg             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_outy_h_a_ois_hg_t;

#define ISM6HG256X_UI_OUTZ_L_A_OIS_HG             0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outz_a_ois_hg             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outz_a_ois_hg             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_outz_l_a_ois_hg_t;

#define ISM6HG256X_UI_OUTZ_H_A_OIS_HG             0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outz_a_ois_hg             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outz_a_ois_hg             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_outz_h_a_ois_hg_t;

#define ISM6HG256X_TIMESTAMP0                     0x40U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_timestamp0_t;

#define ISM6HG256X_TIMESTAMP1                     0x41U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_timestamp1_t;

#define ISM6HG256X_TIMESTAMP2                     0x42U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_timestamp2_t;

#define ISM6HG256X_TIMESTAMP3                     0x43U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_timestamp3_t;

#define ISM6HG256X_UI_STATUS_REG_OIS              0x44U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda_ois                     : 1;
  uint8_t gda_ois                      : 1;
  uint8_t gyro_settling                : 1;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t gyro_settling                : 1;
  uint8_t gda_ois                      : 1;
  uint8_t xlda_ois                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_status_reg_ois_t;

#define ISM6HG256X_WAKE_UP_SRC                    0x45U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_wu                         : 1;
  uint8_t y_wu                         : 1;
  uint8_t x_wu                         : 1;
  uint8_t wu_ia                        : 1;
  uint8_t sleep_state                  : 1;
  uint8_t ff_ia                        : 1;
  uint8_t sleep_change_ia              : 1;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t sleep_change_ia              : 1;
  uint8_t ff_ia                        : 1;
  uint8_t sleep_state                  : 1;
  uint8_t wu_ia                        : 1;
  uint8_t x_wu                         : 1;
  uint8_t y_wu                         : 1;
  uint8_t z_wu                         : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_wake_up_src_t;

#define ISM6HG256X_TAP_SRC                        0x46U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_tap                        : 1;
  uint8_t y_tap                        : 1;
  uint8_t x_tap                        : 1;
  uint8_t tap_sign                     : 1;
  uint8_t double_tap                   : 1;
  uint8_t single_tap                   : 1;
  uint8_t tap_ia                       : 1;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t tap_ia                       : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t tap_sign                     : 1;
  uint8_t x_tap                        : 1;
  uint8_t y_tap                        : 1;
  uint8_t z_tap                        : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_src_t;

#define ISM6HG256X_D6D_SRC                        0x47U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl                           : 1;
  uint8_t xh                           : 1;
  uint8_t yl                           : 1;
  uint8_t yh                           : 1;
  uint8_t zl                           : 1;
  uint8_t zh                           : 1;
  uint8_t d6d_ia                       : 1;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t d6d_ia                       : 1;
  uint8_t zh                           : 1;
  uint8_t zl                           : 1;
  uint8_t yh                           : 1;
  uint8_t yl                           : 1;
  uint8_t xh                           : 1;
  uint8_t xl                           : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_d6d_src_t;

#define ISM6HG256X_STATUS_CONTROLLER_MAINPAGE     0x48U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop               : 1;
  uint8_t not_used0                    : 2;
  uint8_t target0_nack                 : 1;
  uint8_t target1_nack                 : 1;
  uint8_t target2_nack                 : 1;
  uint8_t target3_nack                 : 1;
  uint8_t wr_once_done                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done                 : 1;
  uint8_t target3_nack                 : 1;
  uint8_t target2_nack                 : 1;
  uint8_t target1_nack                 : 1;
  uint8_t target0_nack                 : 1;
  uint8_t not_used0                    : 2;
  uint8_t sens_hub_endop               : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_status_controller_mainpage_t;

#define ISM6HG256X_EMB_FUNC_STATUS_MAINPAGE       0x49U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t is_step_det                  : 1;
  uint8_t is_tilt                      : 1;
  uint8_t is_sigmot                    : 1;
  uint8_t not_used1                    : 1;
  uint8_t is_fsm_lc                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm_lc                    : 1;
  uint8_t not_used1                    : 1;
  uint8_t is_sigmot                    : 1;
  uint8_t is_tilt                      : 1;
  uint8_t is_step_det                  : 1;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_status_mainpage_t;

#define ISM6HG256X_FSM_STATUS_MAINPAGE            0x4AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_fsm1                      : 1;
  uint8_t is_fsm2                      : 1;
  uint8_t is_fsm3                      : 1;
  uint8_t is_fsm4                      : 1;
  uint8_t is_fsm5                      : 1;
  uint8_t is_fsm6                      : 1;
  uint8_t is_fsm7                      : 1;
  uint8_t is_fsm8                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm8                      : 1;
  uint8_t is_fsm7                      : 1;
  uint8_t is_fsm6                      : 1;
  uint8_t is_fsm5                      : 1;
  uint8_t is_fsm4                      : 1;
  uint8_t is_fsm3                      : 1;
  uint8_t is_fsm2                      : 1;
  uint8_t is_fsm1                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_status_mainpage_t;

#define ISM6HG256X_MLC_STATUS_MAINPAGE            0x4BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_mlc1                      : 1;
  uint8_t is_mlc2                      : 1;
  uint8_t is_mlc3                      : 1;
  uint8_t is_mlc4                      : 1;
  uint8_t is_mlc5                      : 1;
  uint8_t is_mlc6                      : 1;
  uint8_t is_mlc7                      : 1;
  uint8_t is_mlc8                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_mlc8                      : 1;
  uint8_t is_mlc7                      : 1;
  uint8_t is_mlc6                      : 1;
  uint8_t is_mlc5                      : 1;
  uint8_t is_mlc4                      : 1;
  uint8_t is_mlc3                      : 1;
  uint8_t is_mlc2                      : 1;
  uint8_t is_mlc1                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc_status_mainpage_t;

#define ISM6HG256X_HG_WAKE_UP_SRC                 0x4CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hg_z_wu                      : 1;
  uint8_t hg_y_wu                      : 1;
  uint8_t hg_x_wu                      : 1;
  uint8_t hg_wu_ia                     : 1;
  uint8_t hg_wu_change_ia              : 1;
  uint8_t hg_shock_state               : 1;
  uint8_t hg_shock_change_ia           : 1;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t hg_shock_change_ia           : 1;
  uint8_t hg_shock_state               : 1;
  uint8_t hg_wu_change_ia              : 1;
  uint8_t hg_wu_ia                     : 1;
  uint8_t hg_x_wu                      : 1;
  uint8_t hg_y_wu                      : 1;
  uint8_t hg_z_wu                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_wake_up_src_t;

