stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
#define ISM6HG256X_CTRL2_XL_HG                    0x4DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_st                     : 2;
  uint8_t not_used0                    : 2;
  uint8_t hg_usr_off_on_wu             : 1;
  uint8_t not_used1                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 3;
  uint8_t hg_usr_off_on_wu             : 1;
  uint8_t not_used0                    : 2;
  uint8_t xl_hg_st                     : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl2_xl_hg_t;

#define ISM6HG256X_CTRL1_XL_HG                    0x4EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_xl_hg                     : 3;
  uint8_t odr_xl_hg                    : 3;
  uint8_t hg_usr_off_on_out            : 1;
  uint8_t xl_hg_regout_en              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_regout_en              : 1;
  uint8_t hg_usr_off_on_out            : 1;
  uint8_t odr_xl_hg                    : 3;
  uint8_t fs_xl_hg                     : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl1_xl_hg_t;

#define ISM6HG256X_INTERNAL_FREQ                  0x4FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t freq_fine                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t freq_fine                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_internal_freq_t;

#define ISM6HG256X_FUNCTIONS_ENABLE               0x50U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_en                     : 2;
  uint8_t not_used0                    : 1;
  uint8_t dis_rst_lir_all_int          : 1;
  uint8_t not_used1                    : 2;
  uint8_t timestamp_en                 : 1;
  uint8_t interrupts_enable            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t interrupts_enable            : 1;
  uint8_t timestamp_en                 : 1;
  uint8_t not_used1                    : 2;
  uint8_t dis_rst_lir_all_int          : 1;
  uint8_t not_used0                    : 1;
  uint8_t inact_en                     : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_functions_enable_t;

#define ISM6HG256X_HG_FUNCTIONS_ENABLE            0x52U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hg_shock_dur                 : 4;
  uint8_t int1_hg_wu                   : 1;
  uint8_t int2_hg_wu                   : 1;
  uint8_t hg_wu_change_int_sel         : 1;
  uint8_t hg_interrupts_enable         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hg_interrupts_enable         : 1;
  uint8_t hg_wu_change_int_sel         : 1;
  uint8_t int2_hg_wu                   : 1;
  uint8_t int1_hg_wu                   : 1;
  uint8_t hg_shock_dur                 : 4;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_functions_enable_t;

#define ISM6HG256X_HG_WAKE_UP_THS                 0x53U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hg_wk_ths                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hg_wk_ths                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_wake_up_ths_t;

#define ISM6HG256X_INACTIVITY_DUR                 0x54U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_dur                    : 2;
  uint8_t xl_inact_odr                 : 2;
  uint8_t wu_inact_ths_w               : 3;
  uint8_t sleep_status_on_int          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sleep_status_on_int          : 1;
  uint8_t wu_inact_ths_w               : 3;
  uint8_t xl_inact_odr                 : 2;
  uint8_t inact_dur                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_inactivity_dur_t;

#define ISM6HG256X_INACTIVITY_THS                 0x55U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_ths                    : 6;
  uint8_t int1_hg_shock_change         : 1;
  uint8_t int2_hg_shock_change         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_hg_shock_change         : 1;
  uint8_t int1_hg_shock_change         : 1;
  uint8_t inact_ths                    : 6;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_inactivity_ths_t;

#define ISM6HG256X_TAP_CFG0                       0x56U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lir                          : 1;
  uint8_t tap_z_en                     : 1;
  uint8_t tap_y_en                     : 1;
  uint8_t tap_x_en                     : 1;
  uint8_t slope_fds                    : 1;
  uint8_t hw_func_mask_xl_settl        : 1;
  uint8_t low_pass_on_6d               : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t low_pass_on_6d               : 1;
  uint8_t hw_func_mask_xl_settl        : 1;
  uint8_t slope_fds                    : 1;
  uint8_t tap_x_en                     : 1;
  uint8_t tap_y_en                     : 1;
  uint8_t tap_z_en                     : 1;
  uint8_t lir                          : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_cfg0_t;

#define ISM6HG256X_TAP_CFG1                       0x57U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_x                    : 5;
  uint8_t tap_priority                 : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tap_priority                 : 3;
  uint8_t tap_ths_x                    : 5;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_cfg1_t;

#define ISM6HG256X_TAP_CFG2                       0x58U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_y                    : 5;
  uint8_t not_used0                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t tap_ths_y                    : 5;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_cfg2_t;

#define ISM6HG256X_TAP_THS_6D                     0x59U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_z                    : 5;
  uint8_t sixd_ths                     : 2;
  uint8_t d4d_en                       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t d4d_en                       : 1;
  uint8_t sixd_ths                     : 2;
  uint8_t tap_ths_z                    : 5;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_ths_6d_t;

#define ISM6HG256X_TAP_DUR                        0x5AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t shock                        : 2;
  uint8_t quiet                        : 2;
  uint8_t dur                          : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dur                          : 4;
  uint8_t quiet                        : 2;
  uint8_t shock                        : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tap_dur_t;

