stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
#define ISM6HG256X_UI_IF2_SHARED_4                0x69U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_4_t;

#define ISM6HG256X_UI_IF2_SHARED_5                0x6AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_5_t;

#define ISM6HG256X_CTRL_EIS                       0x6BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_g_eis                     : 3;
  uint8_t g_eis_on_g_ois_out_reg       : 1;
  uint8_t lpf_g_eis_bw                 : 1;
  uint8_t not_used0                    : 1;
  uint8_t odr_g_eis                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_g_eis                    : 2;
  uint8_t not_used0                    : 1;
  uint8_t lpf_g_eis_bw                 : 1;
  uint8_t g_eis_on_g_ois_out_reg       : 1;
  uint8_t fs_g_eis                     : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl_eis_t;

#define ISM6HG256X_XL_HG_X_OFS_USR                0x6CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_x_ofs_usr              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_x_ofs_usr              : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_x_ofs_usr_t;

#define ISM6HG256X_XL_HG_Y_OFS_USR                0x6DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_y_ofs_usr              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_y_ofs_usr              : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_y_ofs_usr_t;

#define ISM6HG256X_XL_HG_Z_OFS_USR                0x6EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_z_ofs_usr              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_z_ofs_usr              : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_hg_z_ofs_usr_t;

#define ISM6HG256X_UI_INT_OIS                     0x6FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t st_ois_clampdis              : 1;
  uint8_t not_used1                    : 1;
  uint8_t drdy_mask_ois                : 1;
  uint8_t int2_drdy_ois                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_drdy_ois                : 1;
  uint8_t drdy_mask_ois                : 1;
  uint8_t not_used1                    : 1;
  uint8_t st_ois_clampdis              : 1;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_int_ois_t;

#define ISM6HG256X_UI_CTRL1_OIS                   0x70U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_spi_read_en              : 1;
  uint8_t ois_g_en                     : 1;
  uint8_t ois_xl_en                    : 1;
  uint8_t not_used0                    : 2;
  uint8_t sim_ois                      : 1;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t sim_ois                      : 1;
  uint8_t not_used0                    : 2;
  uint8_t ois_xl_en                    : 1;
  uint8_t ois_g_en                     : 1;
  uint8_t if2_spi_read_en              : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_ctrl1_ois_t;

#define ISM6HG256X_UI_CTRL2_OIS                   0x71U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_g_ois                     : 3;
  uint8_t lpf1_g_ois_bw                : 2;
  uint8_t not_used0                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t lpf1_g_ois_bw                : 2;
  uint8_t fs_g_ois                     : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_ctrl2_ois_t;

#define ISM6HG256X_UI_CTRL3_OIS                   0x72U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_xl_ois                    : 2;
  uint8_t not_used0                    : 1;
  uint8_t lpf_xl_ois_bw                : 3;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t lpf_xl_ois_bw                : 3;
  uint8_t not_used0                    : 1;
  uint8_t fs_xl_ois                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_ctrl3_ois_t;

#define ISM6HG256X_X_OFS_USR                      0x73U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x_ofs_usr                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t x_ofs_usr                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_x_ofs_usr_t;

#define ISM6HG256X_Y_OFS_USR                      0x74U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t y_ofs_usr                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t y_ofs_usr                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_y_ofs_usr_t;

#define ISM6HG256X_Z_OFS_USR                      0x75U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_ofs_usr                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t z_ofs_usr                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_z_ofs_usr_t;

#define ISM6HG256X_FIFO_DATA_OUT_TAG              0x78U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t tag_cnt                      : 2;
  uint8_t tag_sensor                   : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tag_sensor                   : 5;
  uint8_t tag_cnt                      : 2;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_tag_t;

#define ISM6HG256X_FIFO_DATA_OUT_X_L              0x79U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_x_l_t;

#define ISM6HG256X_FIFO_DATA_OUT_X_H              0x7AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_x_h_t;

