stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
#define ISM6HG256X_SFLP_GBIASX_INIT_L             0x32U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasx_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasx_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasx_init_l_t;

#define ISM6HG256X_SFLP_GBIASX_INIT_H             0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasx_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasx_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasx_init_h_t;

#define ISM6HG256X_SFLP_GBIASY_INIT_L             0x34U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasy_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasy_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasy_init_l_t;

#define ISM6HG256X_SFLP_GBIASY_INIT_H             0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasy_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasy_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasy_init_h_t;

#define ISM6HG256X_SFLP_GBIASZ_INIT_L             0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasz_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasz_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasz_init_l_t;

#define ISM6HG256X_SFLP_GBIASZ_INIT_H             0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sflp_gbiasz_init             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sflp_gbiasz_init             : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_gbiasz_init_h_t;

#define ISM6HG256X_EMB_FUNC_FIFO_EN_A             0x44U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t sflp_game_fifo_en            : 1;
  uint8_t not_used1                    : 2;
  uint8_t sflp_gravity_fifo_en         : 1;
  uint8_t sflp_gbias_fifo_en           : 1;
  uint8_t step_counter_fifo_en         : 1;
  uint8_t mlc_fifo_en                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_fifo_en                  : 1;
  uint8_t step_counter_fifo_en         : 1;
  uint8_t sflp_gbias_fifo_en           : 1;
  uint8_t sflp_gravity_fifo_en         : 1;
  uint8_t not_used1                    : 2;
  uint8_t sflp_game_fifo_en            : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_fifo_en_a_t;

#define ISM6HG256X_EMB_FUNC_FIFO_EN_B             0x45U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t mlc_filter_feature_fifo_en   : 1;
  uint8_t fsm_fifo_en                  : 1;
  uint8_t not_used1                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 5;
  uint8_t fsm_fifo_en                  : 1;
  uint8_t mlc_filter_feature_fifo_en   : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_fifo_en_b_t;

#define ISM6HG256X_FSM_ENABLE                     0x46U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm1_en                      : 1;
  uint8_t fsm2_en                      : 1;
  uint8_t fsm3_en                      : 1;
  uint8_t fsm4_en                      : 1;
  uint8_t fsm5_en                      : 1;
  uint8_t fsm6_en                      : 1;
  uint8_t fsm7_en                      : 1;
  uint8_t fsm8_en                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm8_en                      : 1;
  uint8_t fsm7_en                      : 1;
  uint8_t fsm6_en                      : 1;
  uint8_t fsm5_en                      : 1;
  uint8_t fsm4_en                      : 1;
  uint8_t fsm3_en                      : 1;
  uint8_t fsm2_en                      : 1;
  uint8_t fsm1_en                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_enable_t;

#define ISM6HG256X_FSM_LONG_COUNTER_L             0x48U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc                       : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_long_counter_l_t;

#define ISM6HG256X_FSM_LONG_COUNTER_H             0x49U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc                       : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_long_counter_h_t;

#define ISM6HG256X_INT_ACK_MASK                   0x4BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t iack_mask                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t iack_mask                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_int_ack_mask_t;

#define ISM6HG256X_FSM_OUTS1                      0x4CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm1_n_v                     : 1;
  uint8_t fsm1_p_v                     : 1;
  uint8_t fsm1_n_z                     : 1;
  uint8_t fsm1_p_z                     : 1;
  uint8_t fsm1_n_y                     : 1;
  uint8_t fsm1_p_y                     : 1;
  uint8_t fsm1_n_x                     : 1;
  uint8_t fsm1_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm1_p_x                     : 1;
  uint8_t fsm1_n_x                     : 1;
  uint8_t fsm1_p_y                     : 1;
  uint8_t fsm1_n_y                     : 1;
  uint8_t fsm1_p_z                     : 1;
  uint8_t fsm1_n_z                     : 1;
  uint8_t fsm1_p_v                     : 1;
  uint8_t fsm1_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs1_t;

