stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t ism6hg256x_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);
int32_t ism6hg256x_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);

float_t ism6hg256x_from_sflp_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs2_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs4_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs8_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs16_to_mg(int16_t lsb);

float_t ism6hg256x_from_fs32_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs64_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs128_to_mg(int16_t lsb);
float_t ism6hg256x_from_fs256_to_mg(int16_t lsb);

float_t ism6hg256x_from_fs500_to_mdps(int16_t lsb);
float_t ism6hg256x_from_fs250_to_mdps(int16_t lsb);
float_t ism6hg256x_from_fs1000_to_mdps(int16_t lsb);
float_t ism6hg256x_from_fs2000_to_mdps(int16_t lsb);
float_t ism6hg256x_from_fs4000_to_mdps(int16_t lsb);

float_t ism6hg256x_from_lsb_to_celsius(int16_t lsb);

uint64_t ism6hg256x_from_lsb_to_nsec(uint32_t lsb);

float_t ism6hg256x_from_lsb_to_mv(int16_t lsb);

float_t ism6hg256x_from_gbias_lsb_to_mdps(int16_t lsb);
float_t ism6hg256x_from_gravity_lsb_to_mg(int16_t lsb);
float_t ism6hg256x_from_quaternion_lsb_to_float(uint16_t lsb);

int32_t ism6hg256x_xl_offset_on_out_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_xl_offset_on_out_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  float_t z_mg;
  float_t y_mg;
  float_t x_mg;
} ism6hg256x_xl_offset_mg_t;
int32_t ism6hg256x_xl_offset_mg_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_xl_offset_mg_t val);
int32_t ism6hg256x_xl_offset_mg_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_xl_offset_mg_t *val);

int32_t ism6hg256x_hg_xl_offset_mg_set(const stmdev_ctx_t *ctx,
                                       ism6hg256x_xl_offset_mg_t val);
int32_t ism6hg256x_hg_xl_offset_mg_get(const stmdev_ctx_t *ctx,
                                       ism6hg256x_xl_offset_mg_t *val);

typedef enum
{
  ISM6HG256X_READY             = 0x0,
  ISM6HG256X_GLOBAL_RST        = 0x1,
  ISM6HG256X_RESTORE_CAL_PARAM = 0x2,
  ISM6HG256X_RESTORE_CTRL_REGS = 0x4,
} ism6hg256x_reset_t;
int32_t ism6hg256x_reset_set(const stmdev_ctx_t *ctx, ism6hg256x_reset_t val);
int32_t ism6hg256x_reset_get(const stmdev_ctx_t *ctx, ism6hg256x_reset_t *val);

typedef enum
{
  ISM6HG256X_MAIN_MEM_BANK       = 0x0,
  ISM6HG256X_EMBED_FUNC_MEM_BANK = 0x1,
  ISM6HG256X_SENSOR_HUB_MEM_BANK = 0x2,
} ism6hg256x_mem_bank_t;
int32_t ism6hg256x_mem_bank_set(const stmdev_ctx_t *ctx, ism6hg256x_mem_bank_t val);
int32_t ism6hg256x_mem_bank_get(const stmdev_ctx_t *ctx, ism6hg256x_mem_bank_t *val);

int32_t ism6hg256x_device_id_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_ODR_OFF              = 0x0,
  ISM6HG256X_ODR_AT_1Hz875        = 0x1,
  ISM6HG256X_ODR_AT_7Hz5          = 0x2,
  ISM6HG256X_ODR_AT_15Hz          = 0x3,
  ISM6HG256X_ODR_AT_30Hz          = 0x4,
  ISM6HG256X_ODR_AT_60Hz          = 0x5,
  ISM6HG256X_ODR_AT_120Hz         = 0x6,
  ISM6HG256X_ODR_AT_240Hz         = 0x7,
  ISM6HG256X_ODR_AT_480Hz         = 0x8,
  ISM6HG256X_ODR_AT_960Hz         = 0x9,
  ISM6HG256X_ODR_AT_1920Hz        = 0xA,
  ISM6HG256X_ODR_AT_3840Hz        = 0xB,
  ISM6HG256X_ODR_AT_7680Hz        = 0xC,
  ISM6HG256X_ODR_HA01_AT_15Hz625  = 0x13,
  ISM6HG256X_ODR_HA01_AT_31Hz25   = 0x14,
  ISM6HG256X_ODR_HA01_AT_62Hz5    = 0x15,
  ISM6HG256X_ODR_HA01_AT_125Hz    = 0x16,
  ISM6HG256X_ODR_HA01_AT_250Hz    = 0x17,
  ISM6HG256X_ODR_HA01_AT_500Hz    = 0x18,
  ISM6HG256X_ODR_HA01_AT_1000Hz   = 0x19,
  ISM6HG256X_ODR_HA01_AT_2000Hz   = 0x1A,
  ISM6HG256X_ODR_HA01_AT_4000Hz   = 0x1B,
  ISM6HG256X_ODR_HA01_AT_8000Hz   = 0x1C,
  ISM6HG256X_ODR_HA02_AT_13Hz     = 0x23,
  ISM6HG256X_ODR_HA02_AT_26Hz     = 0x24,
  ISM6HG256X_ODR_HA02_AT_52Hz     = 0x25,
  ISM6HG256X_ODR_HA02_AT_104Hz    = 0x26,
  ISM6HG256X_ODR_HA02_AT_208Hz    = 0x27,
  ISM6HG256X_ODR_HA02_AT_417Hz    = 0x28,
  ISM6HG256X_ODR_HA02_AT_833Hz    = 0x29,
  ISM6HG256X_ODR_HA02_AT_1667Hz   = 0x2A,
  ISM6HG256X_ODR_HA02_AT_3333Hz   = 0x2B,
  ISM6HG256X_ODR_HA02_AT_6667Hz   = 0x2C,
} ism6hg256x_data_rate_t;
int32_t ism6hg256x_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_data_rate_t val);
int32_t ism6hg256x_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_data_rate_t *val);
int32_t ism6hg256x_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_data_rate_t val);
int32_t ism6hg256x_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_data_rate_t *val);

typedef enum
{
  ISM6HG256X_HG_XL_ODR_OFF         = 0x0,
  ISM6HG256X_HG_XL_ODR_AT_480Hz    = 0x3,
  ISM6HG256X_HG_XL_ODR_AT_960Hz    = 0x4,
  ISM6HG256X_HG_XL_ODR_AT_1920Hz   = 0x5,
  ISM6HG256X_HG_XL_ODR_AT_3840Hz   = 0x6,
  ISM6HG256X_HG_XL_ODR_AT_7680Hz   = 0x7,
} ism6hg256x_hg_xl_data_rate_t;
int32_t ism6hg256x_hg_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                       ism6hg256x_hg_xl_data_rate_t val,
                                       uint8_t reg_out_en);
int32_t ism6hg256x_hg_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                       ism6hg256x_hg_xl_data_rate_t *val,
                                       uint8_t *reg_out_en);

