stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
int32_t ism6hg256x_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                       ism6hg256x_data_ready_t *val);

int32_t ism6hg256x_int_ack_mask_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_int_ack_mask_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_ois_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_ois_eis_angular_rate_raw_get(const stmdev_ctx_t *ctx,
                                                int16_t *val);

int32_t ism6hg256x_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_ois_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_hg_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism6hg256x_sflp_gbias_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
int32_t ism6hg256x_sflp_gravity_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
int32_t ism6hg256x_sflp_quaternion_raw_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_odr_cal_reg_get(const stmdev_ctx_t *ctx, int8_t *val);

int32_t ism6hg256x_disable_embedded_function_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_disable_embedded_function_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t xl_hg_conv_en                : 1;
  uint8_t gyro_conv_en                 : 1;
  uint8_t temp_conv_en                 : 1;
  uint8_t ext_sensor_conv_en           : 1;
} ism6hg256x_emb_func_conv_t;
int32_t ism6hg256x_emb_func_conv_set(const stmdev_ctx_t *ctx, ism6hg256x_emb_func_conv_t val);
int32_t ism6hg256x_emb_func_conv_get(const stmdev_ctx_t *ctx, ism6hg256x_emb_func_conv_t *val);

int32_t ism6hg256x_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                               uint8_t *buf, uint8_t len);
int32_t ism6hg256x_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address, uint8_t *buf,
                              uint8_t len);

int32_t ism6hg256x_emb_function_dbg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_emb_function_dbg_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_DEN_ACT_LOW  = 0x0,
  ISM6HG256X_DEN_ACT_HIGH = 0x1,
} ism6hg256x_den_polarity_t;
int32_t ism6hg256x_den_polarity_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_den_polarity_t val);
int32_t ism6hg256x_den_polarity_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_den_polarity_t *val);

typedef enum
{
  ISM6HG256X_EIS_250dps  = 0x1,
  ISM6HG256X_EIS_500dps  = 0x2,
  ISM6HG256X_EIS_1000dps = 0x3,
  ISM6HG256X_EIS_2000dps = 0x4,
  ISM6HG256X_EIS_4000dps = 0x5,
} ism6hg256x_eis_gy_full_scale_t;
int32_t ism6hg256x_eis_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                         ism6hg256x_eis_gy_full_scale_t val);
int32_t ism6hg256x_eis_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                         ism6hg256x_eis_gy_full_scale_t *val);

int32_t ism6hg256x_eis_gy_on_if2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_eis_gy_on_if2_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_EIS_ODR_OFF = 0x0,
  ISM6HG256X_EIS_1920Hz  = 0x1,
  ISM6HG256X_EIS_960Hz   = 0x2,
} ism6hg256x_gy_eis_data_rate_t;
int32_t ism6hg256x_gy_eis_data_rate_set(const stmdev_ctx_t *ctx,
                                        ism6hg256x_gy_eis_data_rate_t val);
int32_t ism6hg256x_gy_eis_data_rate_get(const stmdev_ctx_t *ctx,
                                        ism6hg256x_gy_eis_data_rate_t *val);

int32_t ism6hg256x_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_CMP_DISABLE = 0x0,
  ISM6HG256X_CMP_8_TO_1  = 0x1,
  ISM6HG256X_CMP_16_TO_1 = 0x2,
  ISM6HG256X_CMP_32_TO_1 = 0x3,
} ism6hg256x_fifo_compress_algo_t;
int32_t ism6hg256x_fifo_compress_algo_set(const stmdev_ctx_t *ctx,
                                          ism6hg256x_fifo_compress_algo_t val);
int32_t ism6hg256x_fifo_compress_algo_get(const stmdev_ctx_t *ctx,
                                          ism6hg256x_fifo_compress_algo_t *val);

int32_t ism6hg256x_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism6hg256x_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                 uint8_t *val);

int32_t ism6hg256x_fifo_compress_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                    uint8_t val);
int32_t ism6hg256x_fifo_compress_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                    uint8_t *val);

int32_t ism6hg256x_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_XL_NOT_BATCHED       = 0x0,
  ISM6HG256X_XL_BATCHED_AT_1Hz875 = 0x1,
  ISM6HG256X_XL_BATCHED_AT_7Hz5   = 0x2,
  ISM6HG256X_XL_BATCHED_AT_15Hz   = 0x3,
  ISM6HG256X_XL_BATCHED_AT_30Hz   = 0x4,
  ISM6HG256X_XL_BATCHED_AT_60Hz   = 0x5,
  ISM6HG256X_XL_BATCHED_AT_120Hz  = 0x6,
  ISM6HG256X_XL_BATCHED_AT_240Hz  = 0x7,
  ISM6HG256X_XL_BATCHED_AT_480Hz  = 0x8,
  ISM6HG256X_XL_BATCHED_AT_960Hz  = 0x9,
  ISM6HG256X_XL_BATCHED_AT_1920Hz = 0xa,
  ISM6HG256X_XL_BATCHED_AT_3840Hz = 0xb,
  ISM6HG256X_XL_BATCHED_AT_7680Hz = 0xc,
} ism6hg256x_fifo_xl_batch_t;
int32_t ism6hg256x_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                     ism6hg256x_fifo_xl_batch_t val);
int32_t ism6hg256x_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                     ism6hg256x_fifo_xl_batch_t *val);

