stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
typedef enum
{
  ISM6HG256X_EIS_LP_NORMAL = 0x0,
  ISM6HG256X_EIS_LP_LIGHT  = 0x1,
} ism6hg256x_filt_gy_eis_lp_bandwidth_t;
int32_t ism6hg256x_filt_gy_eis_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_gy_eis_lp_bandwidth_t val);
int32_t ism6hg256x_filt_gy_eis_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_gy_eis_lp_bandwidth_t *val);

typedef enum
{
  ISM6HG256X_OIS_GY_LP_NORMAL     = 0x0,
  ISM6HG256X_OIS_GY_LP_STRONG     = 0x1,
  ISM6HG256X_OIS_GY_LP_AGGRESSIVE = 0x2,
  ISM6HG256X_OIS_GY_LP_LIGHT      = 0x3,
} ism6hg256x_filt_gy_ois_lp_bandwidth_t;
int32_t ism6hg256x_filt_gy_ois_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_gy_ois_lp_bandwidth_t val);
int32_t ism6hg256x_filt_gy_ois_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_gy_ois_lp_bandwidth_t *val);

typedef enum
{
  ISM6HG256X_OIS_XL_LP_ULTRA_LIGHT = 0x0,
  ISM6HG256X_OIS_XL_LP_VERY_LIGHT  = 0x1,
  ISM6HG256X_OIS_XL_LP_LIGHT       = 0x2,
  ISM6HG256X_OIS_XL_LP_NORMAL      = 0x3,
  ISM6HG256X_OIS_XL_LP_STRONG      = 0x4,
  ISM6HG256X_OIS_XL_LP_VERY_STRONG = 0x5,
  ISM6HG256X_OIS_XL_LP_AGGRESSIVE  = 0x6,
  ISM6HG256X_OIS_XL_LP_XTREME      = 0x7,
} ism6hg256x_filt_xl_ois_lp_bandwidth_t;
int32_t ism6hg256x_filt_xl_ois_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_xl_ois_lp_bandwidth_t val);
int32_t ism6hg256x_filt_xl_ois_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                ism6hg256x_filt_xl_ois_lp_bandwidth_t *val);

typedef enum
{
  ISM6HG256X_PROTECT_CTRL_REGS = 0x0,
  ISM6HG256X_WRITE_CTRL_REG    = 0x1,
} ism6hg256x_fsm_permission_t;
int32_t ism6hg256x_fsm_permission_set(const stmdev_ctx_t *ctx,
                                      ism6hg256x_fsm_permission_t val);
int32_t ism6hg256x_fsm_permission_get(const stmdev_ctx_t *ctx,
                                      ism6hg256x_fsm_permission_t *val);
int32_t ism6hg256x_fsm_permission_status(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t fsm1_en                      : 1;
  uint8_t fsm2_en                      : 1;
  uint8_t fsm3_en                      : 1;
  uint8_t fsm4_en                      : 1;
  uint8_t fsm5_en                      : 1;
  uint8_t fsm6_en                      : 1;
  uint8_t fsm7_en                      : 1;
  uint8_t fsm8_en                      : 1;
} ism6hg256x_fsm_mode_t;
int32_t ism6hg256x_fsm_mode_set(const stmdev_ctx_t *ctx, ism6hg256x_fsm_mode_t val);
int32_t ism6hg256x_fsm_mode_get(const stmdev_ctx_t *ctx, ism6hg256x_fsm_mode_t *val);

int32_t ism6hg256x_fsm_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t ism6hg256x_fsm_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);


typedef struct
{
  uint8_t fsm_outs1;
  uint8_t fsm_outs2;
  uint8_t fsm_outs3;
  uint8_t fsm_outs4;
  uint8_t fsm_outs5;
  uint8_t fsm_outs6;
  uint8_t fsm_outs7;
  uint8_t fsm_outs8;
} ism6hg256x_fsm_out_t;
int32_t ism6hg256x_fsm_out_get(const stmdev_ctx_t *ctx, ism6hg256x_fsm_out_t *val);

typedef enum
{
  ISM6HG256X_FSM_15Hz  = 0x0,
  ISM6HG256X_FSM_30Hz  = 0x1,
  ISM6HG256X_FSM_60Hz  = 0x2,
  ISM6HG256X_FSM_120Hz = 0x3,
  ISM6HG256X_FSM_240Hz = 0x4,
  ISM6HG256X_FSM_480Hz = 0x5,
  ISM6HG256X_FSM_960Hz = 0x6,
} ism6hg256x_fsm_data_rate_t;
int32_t ism6hg256x_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                     ism6hg256x_fsm_data_rate_t val);
int32_t ism6hg256x_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                     ism6hg256x_fsm_data_rate_t *val);

int32_t ism6hg256x_fsm_ext_sens_sensitivity_set(const stmdev_ctx_t *ctx,
                                                uint16_t val);
int32_t ism6hg256x_fsm_ext_sens_sensitivity_get(const stmdev_ctx_t *ctx,
                                                uint16_t *val);

typedef struct
{
  uint16_t z;
  uint16_t y;
  uint16_t x;
} ism6hg256x_xl_fsm_ext_sens_offset_t;
int32_t ism6hg256x_fsm_ext_sens_offset_set(const stmdev_ctx_t *ctx,
                                           ism6hg256x_xl_fsm_ext_sens_offset_t val);
int32_t ism6hg256x_fsm_ext_sens_offset_get(const stmdev_ctx_t *ctx,
                                           ism6hg256x_xl_fsm_ext_sens_offset_t *val);

typedef struct
{
  uint16_t xx;
  uint16_t xy;
  uint16_t xz;
  uint16_t yy;
  uint16_t yz;
  uint16_t zz;
} ism6hg256x_xl_fsm_ext_sens_matrix_t;
int32_t ism6hg256x_fsm_ext_sens_matrix_set(const stmdev_ctx_t *ctx,
                                           ism6hg256x_xl_fsm_ext_sens_matrix_t val);
int32_t ism6hg256x_fsm_ext_sens_matrix_get(const stmdev_ctx_t *ctx,
                                           ism6hg256x_xl_fsm_ext_sens_matrix_t *val);

typedef enum
{
  ISM6HG256X_Z_EQ_Y     = 0x0,
  ISM6HG256X_Z_EQ_MIN_Y = 0x1,
  ISM6HG256X_Z_EQ_X     = 0x2,
  ISM6HG256X_Z_EQ_MIN_X = 0x3,
  ISM6HG256X_Z_EQ_MIN_Z = 0x4,
  ISM6HG256X_Z_EQ_Z     = 0x5,
} ism6hg256x_fsm_ext_sens_z_orient_t;
int32_t ism6hg256x_fsm_ext_sens_z_orient_set(const stmdev_ctx_t *ctx,
                                             ism6hg256x_fsm_ext_sens_z_orient_t val);
int32_t ism6hg256x_fsm_ext_sens_z_orient_get(const stmdev_ctx_t *ctx,
                                             ism6hg256x_fsm_ext_sens_z_orient_t *val);

typedef enum
{
  ISM6HG256X_Y_EQ_Y     = 0x0,
  ISM6HG256X_Y_EQ_MIN_Y = 0x1,
  ISM6HG256X_Y_EQ_X     = 0x2,
  ISM6HG256X_Y_EQ_MIN_X = 0x3,
  ISM6HG256X_Y_EQ_MIN_Z = 0x4,
  ISM6HG256X_Y_EQ_Z     = 0x5,
} ism6hg256x_fsm_ext_sens_y_orient_t;
int32_t ism6hg256x_fsm_ext_sens_y_orient_set(const stmdev_ctx_t *ctx,
                                             ism6hg256x_fsm_ext_sens_y_orient_t val);
int32_t ism6hg256x_fsm_ext_sens_y_orient_get(const stmdev_ctx_t *ctx,
                                             ism6hg256x_fsm_ext_sens_y_orient_t *val);

