stm32-hotspot/staiotcraft_ai_inertial_nucleo-u575zi-q_x-nucleo-iks5a1/Drivers/BSP/Components/ism6hg256x/ism6hg256x_reg.h
typedef enum
{
  ISM6HG256X_OIS_2g  = 0x0,
  ISM6HG256X_OIS_4g  = 0x1,
  ISM6HG256X_OIS_8g  = 0x2,
  ISM6HG256X_OIS_16g = 0x3,
} ism6hg256x_ois_xl_full_scale_t;
int32_t ism6hg256x_ois_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                         ism6hg256x_ois_xl_full_scale_t val);
int32_t ism6hg256x_ois_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                         ism6hg256x_ois_xl_full_scale_t *val);

typedef enum
{
  ISM6HG256X_DEG_80 = 0x0,
  ISM6HG256X_DEG_70 = 0x1,
  ISM6HG256X_DEG_60 = 0x2,
  ISM6HG256X_DEG_50 = 0x3,
} ism6hg256x_6d_threshold_t;
int32_t ism6hg256x_6d_threshold_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_6d_threshold_t val);
int32_t ism6hg256x_6d_threshold_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_6d_threshold_t *val);

int32_t ism6hg256x_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_I2C_I3C_ENABLE  = 0x0,
  ISM6HG256X_I2C_I3C_DISABLE = 0x1,
} ism6hg256x_ui_i2c_i3c_mode_t;
int32_t ism6hg256x_ui_i2c_i3c_mode_set(const stmdev_ctx_t *ctx,
                                       ism6hg256x_ui_i2c_i3c_mode_t val);
int32_t ism6hg256x_ui_i2c_i3c_mode_get(const stmdev_ctx_t *ctx,
                                       ism6hg256x_ui_i2c_i3c_mode_t *val);

typedef struct
{
  uint8_t if2_ta0_pid                  : 1;
  enum
  {
    ISM6HG256X_SW_RST_DYN_ADDRESS_RST = 0x0,
    ISM6HG256X_I3C_GLOBAL_RST         = 0x1,
  } rst_mode;
  enum
  {
    ISM6HG256X_IBI_50us = 0x0,
    ISM6HG256X_IBI_2us  = 0x1,
    ISM6HG256X_IBI_1ms  = 0x2,
    ISM6HG256X_IBI_50ms = 0x3,
  } ibi_time;
} ism6hg256x_i3c_config_t;

int32_t ism6hg256x_i3c_config_set(const stmdev_ctx_t *ctx,
                                  ism6hg256x_i3c_config_t val);
int32_t ism6hg256x_i3c_config_get(const stmdev_ctx_t *ctx,
                                  ism6hg256x_i3c_config_t *val);

int32_t ism6hg256x_sh_controller_interface_pull_up_set(const stmdev_ctx_t *ctx,
                                                       uint8_t val);
int32_t ism6hg256x_sh_controller_interface_pull_up_get(const stmdev_ctx_t *ctx,
                                                       uint8_t *val);

int32_t ism6hg256x_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                        uint8_t len);

typedef enum
{
  ISM6HG256X_TGT_0       = 0x0,
  ISM6HG256X_TGT_0_1     = 0x1,
  ISM6HG256X_TGT_0_1_2   = 0x2,
  ISM6HG256X_TGT_0_1_2_3 = 0x3,
} ism6hg256x_sh_target_connected_t;
int32_t ism6hg256x_sh_target_connected_set(const stmdev_ctx_t *ctx,
                                           ism6hg256x_sh_target_connected_t val);
int32_t ism6hg256x_sh_target_connected_get(const stmdev_ctx_t *ctx,
                                           ism6hg256x_sh_target_connected_t *val);

int32_t ism6hg256x_sh_controller_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_sh_controller_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_sh_pass_through_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_sh_pass_through_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_SH_TRG_XL_GY_DRDY = 0x0,
  ISM6HG256X_SH_TRIG_INT2      = 0x1,
} ism6hg256x_sh_syncro_mode_t;
int32_t ism6hg256x_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                      ism6hg256x_sh_syncro_mode_t val);
int32_t ism6hg256x_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                      ism6hg256x_sh_syncro_mode_t *val);

typedef enum
{
  ISM6HG256X_EACH_SH_CYCLE    = 0x0,
  ISM6HG256X_ONLY_FIRST_CYCLE = 0x1,
} ism6hg256x_sh_write_mode_t;
int32_t ism6hg256x_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                     ism6hg256x_sh_write_mode_t val);
int32_t ism6hg256x_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                     ism6hg256x_sh_write_mode_t *val);

int32_t ism6hg256x_sh_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t   tgt0_add;
  uint8_t   tgt0_subadd;
  uint8_t   tgt0_data;
} ism6hg256x_sh_cfg_write_t;
int32_t ism6hg256x_sh_cfg_write(const stmdev_ctx_t *ctx,
                                ism6hg256x_sh_cfg_write_t *val);
typedef enum
{
  ISM6HG256X_SH_15Hz  = 0x1,
  ISM6HG256X_SH_30Hz  = 0x2,
  ISM6HG256X_SH_60Hz  = 0x3,
  ISM6HG256X_SH_120Hz = 0x4,
  ISM6HG256X_SH_240Hz = 0x5,
  ISM6HG256X_SH_480Hz = 0x6,
} ism6hg256x_sh_data_rate_t;
int32_t ism6hg256x_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                    ism6hg256x_sh_data_rate_t val);
int32_t ism6hg256x_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_sh_data_rate_t *val);

typedef struct
{
  uint8_t   tgt_add;
  uint8_t   tgt_subadd;
  uint8_t   tgt_len;
} ism6hg256x_sh_cfg_read_t;
int32_t ism6hg256x_sh_tgt_cfg_read(const stmdev_ctx_t *ctx, uint8_t idx,
                                   ism6hg256x_sh_cfg_read_t *val);

int32_t ism6hg256x_sh_status_get(const stmdev_ctx_t *ctx,
                                 ism6hg256x_status_controller_t *val);

int32_t ism6hg256x_ui_sdo_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_ui_sdo_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM6HG256X_PAD_LOW_STRENGTH     = 0x1,
  ISM6HG256X_PAD_MIDDLE_STRENGTH  = 0x2,
  ISM6HG256X_PAD_HIGH_STRENGTH    = 0x4,
} ism6hg256x_pad_strength_t;
int32_t ism6hg256x_pad_strength_set(const stmdev_ctx_t *ctx, ism6hg256x_pad_strength_t val);
int32_t ism6hg256x_pad_strength_get(const stmdev_ctx_t *ctx, ism6hg256x_pad_strength_t *val);

typedef enum
{
  ISM6HG256X_SPI_4_WIRE = 0x0,
  ISM6HG256X_SPI_3_WIRE = 0x1,
} ism6hg256x_spi_mode_t;
int32_t ism6hg256x_spi_mode_set(const stmdev_ctx_t *ctx, ism6hg256x_spi_mode_t val);
int32_t ism6hg256x_spi_mode_get(const stmdev_ctx_t *ctx, ism6hg256x_spi_mode_t *val);

int32_t ism6hg256x_ui_sda_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_ui_sda_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_if2_spi_mode_set(const stmdev_ctx_t *ctx, ism6hg256x_spi_mode_t val);
int32_t ism6hg256x_if2_spi_mode_get(const stmdev_ctx_t *ctx,
                                    ism6hg256x_spi_mode_t *val);

